
  #### Terraform Plan Validate All 📖: `success`
  Plan File: `tmp_plan/envs-nonproduction.plan`

  <details><summary>Show Plan</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.base_env.module.shared_vpc.google_access_context_manager_service_perimeter.bridge_to_network_hub_perimeter[0] will be created
  + resource "google_access_context_manager_service_perimeter" "bridge_to_network_hub_perimeter" {
      + create_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = (known after apply)
      + parent                    = "accessPolicies/289988967580"
      + perimeter_type            = "PERIMETER_TYPE_BRIDGE"
      + title                     = (known after apply)
      + update_time               = (known after apply)
      + use_explicit_dry_run_spec = true

      + status {
        }
    }

  # module.base_env.module.shared_vpc.google_compute_global_address.private_service_access_address[0] will be created
  + resource "google_compute_global_address" "private_service_access_address" {
      + address            = "10.16.48.0"
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "ga-n-svpc-spoke-vpc-peering-internal"
      + network            = (known after apply)
      + prefix_length      = 21
      + project            = "prj-n-svpc-y0jb"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.base_env.module.shared_vpc.google_dns_policy.default_policy will be created
  + resource "google_dns_policy" "default_policy" {
      + description               = "Managed by Terraform"
      + enable_inbound_forwarding = true
      + enable_logging            = true
      + id                        = (known after apply)
      + name                      = "dp-n-svpc-default-policy"
      + project                   = "prj-n-svpc-y0jb"

      + networks {
          + network_url = (known after apply)
        }
    }

  # module.base_env.module.shared_vpc.google_service_networking_connection.private_vpc_connection[0] will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "ga-n-svpc-spoke-vpc-peering-internal",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.base_env.module.shared_vpc.random_id.random_access_level_suffix will be created
  + resource "random_id" "random_access_level_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.base_env.module.shared_vpc.time_sleep.wait_vpc_sc_propagation will be created
  + resource "time_sleep" "wait_vpc_sc_propagation" {
      + create_duration  = "60s"
      + destroy_duration = "60s"
      + id               = (known after apply)
    }

  # module.base_env.module.shared_vpc.module.access_level.google_access_context_manager_access_level.access_level will be created
  + resource "google_access_context_manager_access_level" "access_level" {
      + description = "n_shared_vpc Access Level"
      + id          = (known after apply)
      + name        = (known after apply)
      + parent      = "accessPolicies/289988967580"
      + title       = (known after apply)

      + basic {
          + combining_function = "AND"

          + conditions {
              + ip_subnetworks         = []
              + members                = [
                  + "serviceAccount:sa-terraform-net@prj-b-seed-dac6.iam.gserviceaccount.com",
                  + "serviceAccount:sa-terraform-proj@prj-b-seed-dac6.iam.gserviceaccount.com",
                  + "serviceAccount:sa-terraform-org@prj-b-seed-dac6.iam.gserviceaccount.com",
                  + "user:randy.gutierrez@ttecfedgcp.us",
                ]
              + negate                 = false
              + regions                = []
              + required_access_levels = []
            }
        }
    }

  # module.base_env.module.shared_vpc.module.access_level_dry_run.google_access_context_manager_access_level.access_level will be created
  + resource "google_access_context_manager_access_level" "access_level" {
      + description = "n_shared_vpc Access Level for testing with a dry run perimeter"
      + id          = (known after apply)
      + name        = (known after apply)
      + parent      = "accessPolicies/289988967580"
      + title       = (known after apply)

      + basic {
          + combining_function = "AND"

          + conditions {
              + ip_subnetworks         = []
              + members                = [
                  + "serviceAccount:sa-terraform-net@prj-b-seed-dac6.iam.gserviceaccount.com",
                  + "serviceAccount:sa-terraform-proj@prj-b-seed-dac6.iam.gserviceaccount.com",
                  + "serviceAccount:sa-terraform-org@prj-b-seed-dac6.iam.gserviceaccount.com",
                  + "user:randy.gutierrez@ttecfedgcp.us",
                ]
              + negate                 = false
              + regions                = []
              + required_access_levels = []
            }
        }
    }

  # module.base_env.module.shared_vpc.module.firewall_rules.google_compute_network_firewall_policy.fw_policy[0] will be created
  + resource "google_compute_network_firewall_policy" "fw_policy" {
      + creation_timestamp         = (known after apply)
      + description                = "Firewall rules for hub and spoke shared vpc: vpc-n-svpc-spoke."
      + fingerprint                = (known after apply)
      + id                         = (known after apply)
      + name                       = "fp-n-hub-and-spoke-firewalls"
      + network_firewall_policy_id = (known after apply)
      + project                    = "prj-n-svpc-y0jb"
      + rule_tuple_count           = (known after apply)
      + self_link                  = (known after apply)
      + self_link_with_id          = (known after apply)
    }

  # module.base_env.module.shared_vpc.module.firewall_rules.google_compute_network_firewall_policy_association.vpc_associations["cHJvamVjdHMvcHJqLW4tc3ZwYy15MGpiL2dsb2JhbC9uZXR3b3Jrcy92cGMtbi1zdnBjLXNwb2tl"] will be created
  + resource "google_compute_network_firewall_policy_association" "vpc_associations" {
      + attachment_target = "projects/prj-n-svpc-y0jb/global/networks/vpc-n-svpc-spoke"
      + firewall_policy   = "fp-n-hub-and-spoke-firewalls"
      + id                = (known after apply)
      + name              = "fp-n-hub-and-spoke-firewalls-vpc-n-svpc-spoke"
      + project           = "prj-n-svpc-y0jb"
      + short_name        = (known after apply)
    }

  # module.base_env.module.shared_vpc.module.firewall_rules.google_compute_network_firewall_policy_rule.rules["1000"] will be created
  + resource "google_compute_network_firewall_policy_rule" "rules" {
      + action             = "allow"
      + creation_timestamp = (known after apply)
      + description        = "Lower priority rule to allow restricted google apis on TCP port 443."
      + direction          = "EGRESS"
      + enable_logging     = true
      + firewall_policy    = "fp-n-hub-and-spoke-firewalls"
      + id                 = (known after apply)
      + kind               = (known after apply)
      + priority           = 1000
      + project            = "prj-n-svpc-y0jb"
      + rule_name          = "fw-n-svpc-1000-e-a-allow-google-apis-all-tcp-443"
      + rule_tuple_count   = (known after apply)

      + match {
          + dest_address_groups       = []
          + dest_fqdns                = []
          + dest_ip_ranges            = [
              + "10.17.0.7",
            ]
          + dest_region_codes         = []
          + dest_threat_intelligences = []
          + src_address_groups        = []
          + src_fqdns                 = []
          + src_ip_ranges             = []
          + src_region_codes          = []
          + src_threat_intelligences  = []

          + layer4_configs {
              + ip_protocol = "tcp"
              + ports       = [
                  + "443",
                ]
            }
        }
    }

  # module.base_env.module.shared_vpc.module.firewall_rules.google_compute_network_firewall_policy_rule.rules["65530"] will be created
  + resource "google_compute_network_firewall_policy_rule" "rules" {
      + action             = "deny"
      + creation_timestamp = (known after apply)
      + description        = "Lower priority rule to deny all egress traffic."
      + direction          = "EGRESS"
      + enable_logging     = true
      + firewall_policy    = "fp-n-hub-and-spoke-firewalls"
      + id                 = (known after apply)
      + kind               = (known after apply)
      + priority           = 65530
      + project            = "prj-n-svpc-y0jb"
      + rule_name          = "fw-n-svpc-65530-e-d-all-all-all"
      + rule_tuple_count   = (known after apply)

      + match {
          + dest_address_groups       = []
          + dest_fqdns                = []
          + dest_ip_ranges            = [
              + "0.0.0.0/0",
            ]
          + dest_region_codes         = []
          + dest_threat_intelligences = []
          + src_address_groups        = []
          + src_fqdns                 = []
          + src_ip_ranges             = []
          + src_region_codes          = []
          + src_threat_intelligences  = []

          + layer4_configs {
              + ip_protocol = "all"
              + ports       = []
            }
        }
    }

  # module.base_env.module.shared_vpc.module.peering[0].google_compute_network_peering.local_network_peering will be created
  + resource "google_compute_network_peering" "local_network_peering" {
      + export_custom_routes                = false
      + export_subnet_routes_with_public_ip = true
      + id                                  = (known after apply)
      + import_custom_routes                = true
      + import_subnet_routes_with_public_ip = false
      + name                                = (known after apply)
      + network                             = (known after apply)
      + peer_network                        = "https://www.googleapis.com/compute/v1/projects/prj-net-hub-3b43/global/networks/vpc-c-svpc-hub"
      + stack_type                          = "IPV4_ONLY"
      + state                               = (known after apply)
      + state_details                       = (known after apply)
      + update_strategy                     = "INDEPENDENT"
    }

  # module.base_env.module.shared_vpc.module.peering[0].google_compute_network_peering.peer_network_peering will be created
  + resource "google_compute_network_peering" "peer_network_peering" {
      + export_custom_routes                = true
      + export_subnet_routes_with_public_ip = false
      + id                                  = (known after apply)
      + import_custom_routes                = false
      + import_subnet_routes_with_public_ip = true
      + name                                = (known after apply)
      + network                             = "https://www.googleapis.com/compute/v1/projects/prj-net-hub-3b43/global/networks/vpc-c-svpc-hub"
      + peer_network                        = (known after apply)
      + stack_type                          = "IPV4_ONLY"
      + state                               = (known after apply)
      + state_details                       = (known after apply)
      + update_strategy                     = "INDEPENDENT"
    }

  # module.base_env.module.shared_vpc.module.peering[0].null_resource.complete will be created
  + resource "null_resource" "complete" {
      + id = (known after apply)
    }

  # module.base_env.module.shared_vpc.module.peering[0].null_resource.module_depends_on will be created
  + resource "null_resource" "module_depends_on" {
      + id       = (known after apply)
      + triggers = {
          + "value" = "0"
        }
    }

  # module.base_env.module.shared_vpc.module.peering[0].random_string.network_peering_suffix will be created
  + resource "random_string" "network_peering_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.base_env.module.shared_vpc.module.peering_zone[0].google_dns_managed_zone.peering[0] will be created
  + resource "google_dns_managed_zone" "peering" {
      + creation_time    = (known after apply)
      + description      = "Private DNS peering zone."
      + dns_name         = "ms.tthcslabs.com."
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "dz-n-svpc-to-dns-hub"
      + name_servers     = (known after apply)
      + project          = "prj-n-svpc-y0jb"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "private"

      + peering_config {
          + target_network {
              + network_url = "https://www.googleapis.com/compute/v1/projects/prj-net-hub-3b43/global/networks/vpc-c-svpc-hub"
            }
        }

      + private_visibility_config {
          + networks {
              + network_url = (known after apply)
            }
        }
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.google_compute_global_address.private_service_connect will be created
  + resource "google_compute_global_address" "private_service_connect" {
      + address            = "10.17.0.7"
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "global-psconnect-ip"
      + network            = (known after apply)
      + prefix_length      = (known after apply)
      + project            = "prj-n-svpc-y0jb"
      + purpose            = "PRIVATE_SERVICE_CONNECT"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.google_compute_global_forwarding_rule.forwarding_rule_private_service_connect will be created
  + resource "google_compute_global_forwarding_rule" "forwarding_rule_private_service_connect" {
      + allow_psc_global_access = false
      + base_forwarding_rule    = (known after apply)
      + effective_labels        = (known after apply)
      + forwarding_rule_id      = (known after apply)
      + id                      = (known after apply)
      + ip_address              = (known after apply)
      + ip_protocol             = (known after apply)
      + label_fingerprint       = (known after apply)
      + name                    = "globalrule"
      + network                 = (known after apply)
      + network_tier            = (known after apply)
      + project                 = "prj-n-svpc-y0jb"
      + psc_connection_id       = (known after apply)
      + psc_connection_status   = (known after apply)
      + self_link               = (known after apply)
      + subnetwork              = (known after apply)
      + target                  = "vpc-sc"
      + terraform_labels        = (known after apply)
    }

  # module.base_env.module.shared_vpc.module.regular_service_perimeter.google_access_context_manager_service_perimeter.regular_service_perimeter will be created
  + resource "google_access_context_manager_service_perimeter" "regular_service_perimeter" {
      + create_time               = (known after apply)
      + description               = "Default VPC Service Controls perimeter"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + parent                    = "accessPolicies/289988967580"
      + perimeter_type            = "PERIMETER_TYPE_REGULAR"
      + title                     = (known after apply)
      + update_time               = (known after apply)
      + use_explicit_dry_run_spec = true

      + spec {
          + access_levels       = (known after apply)
          + resources           = [
              + "projects/667156031454",
            ]
          + restricted_services = [
              + "accessapproval.googleapis.com",
              + "adsdatahub.googleapis.com",
              + "aiplatform.googleapis.com",
              + "alloydb.googleapis.com",
              + "alpha-documentai.googleapis.com",
              + "analyticshub.googleapis.com",
              + "apigee.googleapis.com",
              + "apigeeconnect.googleapis.com",
              + "artifactregistry.googleapis.com",
              + "assuredworkloads.googleapis.com",
              + "automl.googleapis.com",
              + "baremetalsolution.googleapis.com",
              + "batch.googleapis.com",
              + "bigquery.googleapis.com",
              + "bigquerydatapolicy.googleapis.com",
              + "bigquerydatatransfer.googleapis.com",
              + "bigquerymigration.googleapis.com",
              + "bigqueryreservation.googleapis.com",
              + "bigtable.googleapis.com",
              + "binaryauthorization.googleapis.com",
              + "cloud.googleapis.com",
              + "cloudasset.googleapis.com",
              + "cloudbuild.googleapis.com",
              + "clouddebugger.googleapis.com",
              + "clouddeploy.googleapis.com",
              + "clouderrorreporting.googleapis.com",
              + "cloudfunctions.googleapis.com",
              + "cloudkms.googleapis.com",
              + "cloudprofiler.googleapis.com",
              + "cloudresourcemanager.googleapis.com",
              + "cloudscheduler.googleapis.com",
              + "cloudsearch.googleapis.com",
              + "cloudtrace.googleapis.com",
              + "composer.googleapis.com",
              + "compute.googleapis.com",
              + "connectgateway.googleapis.com",
              + "contactcenterinsights.googleapis.com",
              + "container.googleapis.com",
              + "containeranalysis.googleapis.com",
              + "containerfilesystem.googleapis.com",
              + "containerregistry.googleapis.com",
              + "containerthreatdetection.googleapis.com",
              + "datacatalog.googleapis.com",
              + "dataflow.googleapis.com",
              + "datafusion.googleapis.com",
              + "datamigration.googleapis.com",
              + "dataplex.googleapis.com",
              + "dataproc.googleapis.com",
              + "datastream.googleapis.com",
              + "dialogflow.googleapis.com",
              + "dlp.googleapis.com",
              + "dns.googleapis.com",
              + "documentai.googleapis.com",
              + "domains.googleapis.com",
              + "eventarc.googleapis.com",
              + "file.googleapis.com",
              + "firebaseappcheck.googleapis.com",
              + "firebaserules.googleapis.com",
              + "firestore.googleapis.com",
              + "gameservices.googleapis.com",
              + "gkebackup.googleapis.com",
              + "gkeconnect.googleapis.com",
              + "gkehub.googleapis.com",
              + "healthcare.googleapis.com",
              + "iam.googleapis.com",
              + "iamcredentials.googleapis.com",
              + "iaptunnel.googleapis.com",
              + "ids.googleapis.com",
              + "integrations.googleapis.com",
              + "kmsinventory.googleapis.com",
              + "krmapihosting.googleapis.com",
              + "language.googleapis.com",
              + "lifesciences.googleapis.com",
              + "logging.googleapis.com",
              + "managedidentities.googleapis.com",
              + "memcache.googleapis.com",
              + "meshca.googleapis.com",
              + "meshconfig.googleapis.com",
              + "metastore.googleapis.com",
              + "ml.googleapis.com",
              + "monitoring.googleapis.com",
              + "networkconnectivity.googleapis.com",
              + "networkmanagement.googleapis.com",
              + "networksecurity.googleapis.com",
              + "networkservices.googleapis.com",
              + "notebooks.googleapis.com",
              + "opsconfigmonitoring.googleapis.com",
              + "orgpolicy.googleapis.com",
              + "osconfig.googleapis.com",
              + "oslogin.googleapis.com",
              + "privateca.googleapis.com",
              + "pubsub.googleapis.com",
              + "pubsublite.googleapis.com",
              + "recaptchaenterprise.googleapis.com",
              + "recommender.googleapis.com",
              + "redis.googleapis.com",
              + "retail.googleapis.com",
              + "run.googleapis.com",
              + "secretmanager.googleapis.com",
              + "servicecontrol.googleapis.com",
              + "servicedirectory.googleapis.com",
              + "spanner.googleapis.com",
              + "speakerid.googleapis.com",
              + "speech.googleapis.com",
              + "sqladmin.googleapis.com",
              + "storage.googleapis.com",
              + "storagetransfer.googleapis.com",
              + "sts.googleapis.com",
              + "texttospeech.googleapis.com",
              + "timeseriesinsights.googleapis.com",
              + "tpu.googleapis.com",
              + "trafficdirector.googleapis.com",
              + "transcoder.googleapis.com",
              + "translate.googleapis.com",
              + "videointelligence.googleapis.com",
              + "vision.googleapis.com",
              + "visionai.googleapis.com",
              + "vmmigration.googleapis.com",
              + "vpcaccess.googleapis.com",
              + "webrisk.googleapis.com",
              + "workflows.googleapis.com",
              + "workstations.googleapis.com",
            ]

          + vpc_accessible_services {
              + allowed_services   = [
                  + "RESTRICTED-SERVICES",
                ]
              + enable_restriction = true
            }
        }

      + status {
          + vpc_accessible_services {
              + enable_restriction = true
            }
        }
    }

  # module.base_env.module.shared_vpc.module.main.module.subnets.google_compute_subnetwork.subnetwork["us-central1/sb-n-svpc-us-central1"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + description                = "First nonproduction subnet example."
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.8.128.0/18"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "sb-n-svpc-us-central1"
      + network                    = "vpc-n-svpc-spoke"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "prj-n-svpc-y0jb"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }

      + secondary_ip_range {
          + ip_cidr_range = "100.72.128.0/18"
          + range_name    = "rn-n-svpc-us-central1-gke-pod"
        }
      + secondary_ip_range {
          + ip_cidr_range = "100.73.128.0/18"
          + range_name    = "rn-n-svpc-us-central1-gke-svc"
        }
    }

  # module.base_env.module.shared_vpc.module.main.module.subnets.google_compute_subnetwork.subnetwork["us-central1/sb-n-svpc-us-central1-proxy"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + description                = "First nonproduction proxy-only subnet example."
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.26.4.0/23"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "sb-n-svpc-us-central1-proxy"
      + network                    = "vpc-n-svpc-spoke"
      + private_ip_google_access   = false
      + private_ipv6_google_access = (known after apply)
      + project                    = "prj-n-svpc-y0jb"
      + purpose                    = "REGIONAL_MANAGED_PROXY"
      + region                     = "us-central1"
      + role                       = "ACTIVE"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)
    }

  # module.base_env.module.shared_vpc.module.main.module.subnets.google_compute_subnetwork.subnetwork["us-west1/sb-n-svpc-us-west1"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + description                = "Second nonproduction subnet example."
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.9.128.0/18"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "sb-n-svpc-us-west1"
      + network                    = "vpc-n-svpc-spoke"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "prj-n-svpc-y0jb"
      + purpose                    = (known after apply)
      + region                     = "us-west1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.base_env.module.shared_vpc.module.main.module.subnets.google_compute_subnetwork.subnetwork["us-west1/sb-n-svpc-us-west1-proxy"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + description                = "Second nonproduction proxy-only subnet example."
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.27.4.0/23"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "sb-n-svpc-us-west1-proxy"
      + network                    = "vpc-n-svpc-spoke"
      + private_ip_google_access   = false
      + private_ipv6_google_access = (known after apply)
      + project                    = "prj-n-svpc-y0jb"
      + purpose                    = "REGIONAL_MANAGED_PROXY"
      + region                     = "us-west1"
      + role                       = "ACTIVE"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)
    }

  # module.base_env.module.shared_vpc.module.main.module.vpc.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = true
      + enable_ula_internal_ipv6                  = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = 0
      + name                                      = "vpc-n-svpc-spoke"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "prj-n-svpc-y0jb"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

  # module.base_env.module.shared_vpc.module.main.module.vpc.google_compute_shared_vpc_host_project.shared_vpc_host[0] will be created
  + resource "google_compute_shared_vpc_host_project" "shared_vpc_host" {
      + id      = (known after apply)
      + project = "prj-n-svpc-y0jb"
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.module.gcr.google_dns_managed_zone.private[0] will be created
  + resource "google_dns_managed_zone" "private" {
      + creation_time    = (known after apply)
      + description      = "Private DNS zone to configure gcr.io"
      + dns_name         = "gcr.io."
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "dz-n-svpc-gcr"
      + name_servers     = (known after apply)
      + project          = "prj-n-svpc-y0jb"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "private"

      + private_visibility_config {
          + networks {
              + network_url = (known after apply)
            }
        }
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.module.gcr.google_dns_record_set.cloud-static-records["*/CNAME"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "dz-n-svpc-gcr"
      + name         = "*.gcr.io."
      + project      = "prj-n-svpc-y0jb"
      + rrdatas      = [
          + "gcr.io.",
        ]
      + ttl          = 300
      + type         = "CNAME"
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.module.gcr.google_dns_record_set.cloud-static-records["/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "dz-n-svpc-gcr"
      + name         = "gcr.io."
      + project      = "prj-n-svpc-y0jb"
      + rrdatas      = [
          + "10.17.0.7",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.module.googleapis.google_dns_managed_zone.private[0] will be created
  + resource "google_dns_managed_zone" "private" {
      + creation_time    = (known after apply)
      + description      = "Private DNS zone to configure restricted.googleapis.com."
      + dns_name         = "googleapis.com."
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "dz-n-svpc-apis"
      + name_servers     = (known after apply)
      + project          = "prj-n-svpc-y0jb"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "private"

      + private_visibility_config {
          + networks {
              + network_url = (known after apply)
            }
        }
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.module.googleapis.google_dns_record_set.cloud-static-records["*/CNAME"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "dz-n-svpc-apis"
      + name         = "*.googleapis.com."
      + project      = "prj-n-svpc-y0jb"
      + rrdatas      = [
          + "restricted.googleapis.com.",
        ]
      + ttl          = 300
      + type         = "CNAME"
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.module.googleapis.google_dns_record_set.cloud-static-records["restricted/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "dz-n-svpc-apis"
      + name         = "restricted.googleapis.com."
      + project      = "prj-n-svpc-y0jb"
      + rrdatas      = [
          + "10.17.0.7",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.module.pkg_dev.google_dns_managed_zone.private[0] will be created
  + resource "google_dns_managed_zone" "private" {
      + creation_time    = (known after apply)
      + description      = "Private DNS zone to configure pkg.dev"
      + dns_name         = "pkg.dev."
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "dz-n-svpc-pkg-dev"
      + name_servers     = (known after apply)
      + project          = "prj-n-svpc-y0jb"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "private"

      + private_visibility_config {
          + networks {
              + network_url = (known after apply)
            }
        }
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.module.pkg_dev.google_dns_record_set.cloud-static-records["*/CNAME"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "dz-n-svpc-pkg-dev"
      + name         = "*.pkg.dev."
      + project      = "prj-n-svpc-y0jb"
      + rrdatas      = [
          + "pkg.dev.",
        ]
      + ttl          = 300
      + type         = "CNAME"
    }

  # module.base_env.module.shared_vpc.module.private_service_connect.module.pkg_dev.google_dns_record_set.cloud-static-records["/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "dz-n-svpc-pkg-dev"
      + name         = "pkg.dev."
      + project      = "prj-n-svpc-y0jb"
      + rrdatas      = [
          + "10.17.0.7",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + access_context_manager_policy_id = 289988967580
  + access_level_name                = (known after apply)
  + access_level_name_dry_run        = (known after apply)
  + enforce_vpcsc                    = false
  + network_name                     = "vpc-n-svpc-spoke"
  + network_self_link                = (known after apply)
  + service_perimeter_name           = (known after apply)
  + shared_vpc_host_project_id       = "prj-n-svpc-y0jb"
  + subnets_ips                      = [
      + "10.8.128.0/18",
      + "10.26.4.0/23",
      + "10.9.128.0/18",
      + "10.27.4.0/23",
    ]
  + subnets_names                    = [
      + "sb-n-svpc-us-central1",
      + "sb-n-svpc-us-central1-proxy",
      + "sb-n-svpc-us-west1",
      + "sb-n-svpc-us-west1-proxy",
    ]
  + subnets_secondary_ranges         = [
      + [
          + {
              + ip_cidr_range           = "100.72.128.0/18"
              + range_name              = "rn-n-svpc-us-central1-gke-pod"
              + reserved_internal_range = null
            },
          + {
              + ip_cidr_range           = "100.73.128.0/18"
              + range_name              = "rn-n-svpc-us-central1-gke-svc"
              + reserved_internal_range = null
            },
        ],
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + subnets_self_links               = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]

  ```

  </details>
  
  